{
    "站名": "yfsp",
    "主页url": "https://www.yfsp.tv",
    "分类url": "https://www.libvio.cc/show/{cateId}-{area}-{by}-{class}-----{catePg}---{year}.html",
    "分类": "电视剧&电影&动漫&综艺&短剧",
    "分类值": "drama&movie&anime&variety&drama-short",
/*
  "数组": "data-&&</h4>",
  "图片": "original=\"&&\"",
  "标题": "title=\"&&\"",
  "副标题": "text-right\">&&</span>",
  "链接": "href=\"&&\"",
  "搜索模式": "1",
  "搜索url": "/search.html?wd={wd}",
  "搜索数组": "myui-vodlist__box\">&&</li>",
  "搜索图片": "data-original=\"&&\"",
  "搜索标题": "title=\"&&\"",
  "搜索链接": "<a href=\"&&\"",
  "搜索副标题": "text-right\">&&</span>",
  "影片年代": "年份：&&</p>",
  "影片地区": "地区：&&/",
  "影片类型": "类型：&&/",
  "导演": "导演：&&</p>",
  "主演": "主演：&&</p>",
  "简介": "display: none;\">&&</span>",
  "线路数组": "<span class=\"pull-right\">&&/h3>",
  "线路标题": "<h3>&&<",
  "播放数组": "<ul class=\"myui-content__playlist&&</ul>",
  "过滤词":"=http",
*/
    "筛选":{
"drama":[ {"key":"class","name":"類型","value":[  {"n":"全部","v":""},  {"n":"偶像","v":"-129"},  {"n":"爱情","v":"-146"},  {"n":"言情","v":"-127"},  {"n":"古装","v":"-126"},  {"n":"历史","v":"-141"},  {"n":"玄幻","v":"-142"},  {"n":"谍战","v":"-136"},  {"n":"历险","v":"-143"},  {"n":"都市","v":"-132"},  {"n":"科幻","v":"-144"},  {"n":"军旅","v":"-135"},  {"n":"喜剧","v":"-133"},  {"n":"武侠","v":"-128"},  {"n":"江湖","v":"-145"},  {"n":"罪案","v":"-138"},  {"n":"青春","v":"-131"},  {"n":"家庭","v":"-130"},  {"n":"战争","v":"-134"},  {"n":"悬疑","v":"-137"},  {"n":"穿越","v":"-139"},  {"n":"宫廷","v":"-140"},  {"n":"神话","v":"-147"},  {"n":"商战","v":"-148"},  {"n":"警匪","v":"-149"},  {"n":"动作","v":"-150"},  {"n":"惊悚","v":"-151"},  {"n":"剧情","v":"-152"},  {"n":"同性","v":"-153"},  {"n":"奇幻","v":"-154"}]},  {"key":"area","name":"地区","value":[  {"n":"全部","v":""},  {"n":"大陆","v":"region=大陆"},  {"n":"香港","v":"region=香港"},  {"n":"台湾","v":"region=台湾"},  {"n":"日本","v":"region=日本"},  {"n":"韩国","v":"region=韩国"},  {"n":"欧美","v":"region=欧美"},  {"n":"英国","v":"region=英国"},  {"n":"泰国","v":"region=泰国"},  {"n":"其它","v":"region=其它"}]},  {"key":"year","name":"年份","value":[  {"n":"全部","v":""},  {"n":"今年,v":"year=今年"},  {"n":"去年,v":"year=去年"},  {"n":"更早,v":"year=更早"},  {"n":"90年代,v":"year=90年代"},  {"n":"80年代,v":"year=80年代"},  {"n":"怀旧,v":"year=怀旧"}]}], 
"movie":[ {"key":"class","name":"類型","value":[  {"n":"全部","v":""},  {"n":"喜剧","v":"-19"},  {"n":"爱情","v":"-20"},  {"n":"动作","v":"-21"},  {"n":"犯罪","v":"-22"},  {"n":"科幻","v":"-23"},  {"n":"奇幻","v":"-24"},  {"n":"冒险","v":"-25"},  {"n":"灾难","v":"-26"},  {"n":"恐怖","v":"-123"},  {"n":"惊悚","v":"-27"},  {"n":"剧情","v":"-28"},  {"n":"战争","v":"-29"},  {"n":"歌舞","v":"-30"},  {"n":"经典","v":"-31"},  {"n":"悬疑","v":"-32"},  {"n":"动画","v":"-113"},  {"n":"同性","v":"-124"},  {"n":"网络电影","v":"-125"}]},  {"key":"area","name":"地区","value":[  {"n":"全部","v":""},  {"n":"大陆","v":"region=大陆"},  {"n":"香港","v":"region=香港"},  {"n":"台湾","v":"region=台湾"},  {"n":"日本","v":"region=日本"},  {"n":"韩国","v":"region=韩国"},  {"n":"欧美","v":"region=欧美"},  {"n":"英国","v":"region=英国"},  {"n":"泰国","v":"region=泰国"},  {"n":"其它","v":"region=其它"}]},  {"key":"year","name":"年份","value":[  {"n":"全部","v":""},  {"n":"今年,v":"year=今年"},  {"n":"去年,v":"year=去年"},  {"n":"更早,v":"year=更早"},  {"n":"90年代,v":"year=90年代"},  {"n":"80年代,v":"year=80年代"},  {"n":"怀旧,v":"year=怀旧"}]}], 
"anime":[ {"key":"class","name":"類型","value":[  {"n":"全部","v":""},  {"n":"热血","v":"-46"},  {"n":"格斗","v":"-47"},  {"n":"机战","v":"-48"},  {"n":"少女","v":"-49"},  {"n":"竞技","v":"-51"},  {"n":"科幻","v":"-52"},  {"n":"魔幻","v":"-53"},  {"n":"爆笑","v":"-54"},  {"n":"推理","v":"-55"},  {"n":"冒险","v":"-121"},  {"n":"恋爱","v":"-120"},  {"n":"校园","v":"-119"},  {"n":"治愈","v":"-118"},  {"n":"泡面","v":"-117"},  {"n":"穿越","v":"-116"},  {"n":"灵异","v":"-56"},  {"n":"耽美","v":"-122"},  {"n":"剧场版","v":"-57"},  {"n":"其它","v":"-58"}]},  {"key":"area","name":"地区","value":[  {"n":"全部","v":""},  {"n":"大陆","v":"region=大陆"},  {"n":"香港","v":"region=香港"},  {"n":"台湾","v":"region=台湾"},  {"n":"日本","v":"region=日本"},  {"n":"韩国","v":"region=韩国"},  {"n":"欧美","v":"region=欧美"},  {"n":"英国","v":"region=英国"},  {"n":"泰国","v":"region=泰国"},  {"n":"其它","v":"region=其它"}]},  {"key":"year","name":"年份","value":[  {"n":"全部","v":""},  {"n":"今年,v":"year=今年"},  {"n":"去年,v":"year=去年"},  {"n":"更早,v":"year=更早"},  {"n":"90年代,v":"year=90年代"},  {"n":"80年代,v":"year=80年代"},  {"n":"怀旧,v":"year=怀旧"}]}], 
"variety":[ {"key":"class","name":"類型","value":[  {"n":"全部","v":""},  {"n":"真人秀","v":"-39"},  {"n":"选秀","v":"-38"},  {"n":"网综","v":"-94"},  {"n":"脱口秀","v":"-43"},  {"n":"搞笑","v":"-40"},  {"n":"竞技","v":"-91"},  {"n":"情感","v":"-33"},  {"n":"访谈","v":"-34"},  {"n":"演唱会","v":"-44"},  {"n":"晚会","v":"-92"},  {"n":"其它","v":"-45"}]},  {"key":"area","name":"地区","value":[  {"n":"全部","v":""},  {"n":"大陆","v":"region=大陆"},  {"n":"香港","v":"region=香港"},  {"n":"台湾","v":"region=台湾"},  {"n":"日本","v":"region=日本"},  {"n":"韩国","v":"region=韩国"},  {"n":"欧美","v":"region=欧美"},  {"n":"英国","v":"region=英国"},  {"n":"泰国","v":"region=泰国"},  {"n":"其它","v":"region=其它"}]},  {"key":"year","name":"年份","value":[  {"n":"全部","v":""},  {"n":"今年,v":"year=今年"},  {"n":"去年,v":"year=去年"},  {"n":"更早,v":"year=更早"},  {"n":"90年代,v":"year=90年代"},  {"n":"80年代,v":"year=80年代"},  {"n":"怀旧,v":"year=怀旧"}]}], 
"drama-short":[ {"key":"class","name":"類型","value":[  {"n":"全部","v":""},  {"n":"偶像","v":"-129"},  {"n":"爱情","v":"-146"},  {"n":"言情","v":"-127"},  {"n":"古装","v":"-126"},  {"n":"历史","v":"-141"},  {"n":"玄幻","v":"-142"},  {"n":"谍战","v":"-136"},  {"n":"历险","v":"-143"},  {"n":"都市","v":"-132"},  {"n":"科幻","v":"-144"},  {"n":"军旅","v":"-135"},  {"n":"喜剧","v":"-133"},  {"n":"武侠","v":"-128"},  {"n":"江湖","v":"-145"},  {"n":"罪案","v":"-138"},  {"n":"青春","v":"-131"},  {"n":"家庭","v":"-130"},  {"n":"战争","v":"-134"},  {"n":"悬疑","v":"-137"},  {"n":"穿越","v":"-139"},  {"n":"宫廷","v":"-140"},  {"n":"神话","v":"-147"},  {"n":"商战","v":"-148"},  {"n":"警匪","v":"-149"},  {"n":"动作","v":"-150"},  {"n":"惊悚","v":"-151"},  {"n":"剧情","v":"-152"},  {"n":"同性","v":"-153"},  {"n":"奇幻","v":"-154"}]},  {"key":"year","name":"年份","value":[  {"n":"全部","v":""},  {"n":"今年,v":"year=今年"},  {"n":"去年,v":"year=去年"},  {"n":"更早,v":"year=更早"},  {"n":"90年代,v":"year=90年代"},  {"n":"80年代,v":"year=80年代"},  {"n":"怀旧,v":"year=怀旧"}]}]
    }
}
