{
    "站名": "ystv",
    "主页url": "https://yingshi.tv",
    "分类url": "https://yingshi.tv/vod/show{area}{year}{by}{class}/id/{cateId}",
    "分类": "短剧&电视剧&电影&动漫&综艺&纪录片",
    "分类值": "46&1&2&4&3&5",
        
  "图片": "rounded-lg\" src=\"&&\"",
  "标题": "font-bold">&&</span>",
  "链接": "href=\"&&\"",
  "播放数组": "id=\"*vodSource&&</div",

/*
  "数组": "data-&&</h4>",
  "图片": "original=\"&&\"",
  "标题": "title=\"&&\"",
  "副标题": "text-right\">&&</span>",
  "链接": "href=\"&&\"",
  "搜索模式": "1",
  "搜索url": "/search.html?wd={wd}",
  "搜索数组": "myui-vodlist__box\">&&</li>",
  "搜索图片": "data-original=\"&&\"",
  "搜索标题": "title=\"&&\"",
  "搜索链接": "<a href=\"&&\"",
  "搜索副标题": "text-right\">&&</span>",
  "影片年代": "年份：&&</p>",
  "影片地区": "地区：&&/",
  "影片类型": "类型：&&/",
  "导演": "导演：&&</p>",
  "主演": "主演：&&</p>",
  "简介": "display: none;\">&&</span>",
  "线路数组": "<span class=\"pull-right\">&&/h3>",
  "线路标题": "<h3>&&<",
  "播放数组": "<ul class=\"myui-content__playlist&&</ul>",
  "过滤词":"=http",
*/
    "筛选":{
"1":[{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}],
"2":[{"key":"class","name":"類型","value":[{"n":"全部","v":"1"},{"n":"动画电影",v":"/class/动画电影"},{"n":"喜剧",v":"/class/喜剧"},{"n":"冒险",v":"/class/冒险"},{"n":"爱情",v":"/class/爱情"},{"n":"战争",v":"/class/战争"},{"n":"剧情",v":"/class/剧情"},{"n":"动作",v":"/class/动作"},{"n":"恐怖",v":"/class/恐怖"},{"n":"悬疑",v":"/class/悬疑"},{"n":"奇幻",v":"/class/奇幻"},{"n":"灾难",v":"/class/灾难"},{"n":"同性",v":"/class/同性"},{"n":"惊悚",v":"/class/惊悚"},{"n":"歌舞",v":"/class/歌舞"},{"n":"犯罪",v":"/class/犯罪"},{"n":"科幻",v":"/class/科幻"},{"n":"经典",v":"/class/经典"},{"n":"网络电影",v":"/class/网络电影"},{"n":"其它",v":"/class/其它"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}],
"3":[{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}],
"4":[{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}],
"5":[{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}],
"46":[{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2026","v":"/year/2026"},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014-2011","v":"/year/2014-2011"},{"n":"2010-2000","v":"/year/2010-2000"},{"n":"90年代","v":"/year/90年代"},{"n":"80年代","v":"/year/80年代"},{"n":"更早","v":"/year/更早"}]},{"key":"by","name":"排序","value":[{"n":"新上线","v":"/by/time"},{"n":"热播榜","v":"/by/hits_day"},{"n":"好评榜","v":"/by/score"}]}]
    }
}
