{
    "作者": "🐰兔爷🐇",
    "站名": "xiaoxintv",
    "主页url": "https://xiaoxintv.cc/index.php",
    "分类url": "https://xiaoxintv.cc/index.php/vod/show{area}{by}{cateId}{class}{lang}{catePg}{year}.html",
    "分类": "电视剧&电影&动漫&综艺&短剧",
    "分类值": "6&7&5&3&64",
/*
  "数组": "data-&&</h4>",
  "图片": "original=\"&&\"",
  "标题": "title=\"&&\"",
  "副标题": "text-right\">&&</span>",
  "链接": "href=\"&&\"",
  "搜索模式": "1",
  "搜索url": "/search.html?wd={wd}",
  "搜索数组": "myui-vodlist__box\">&&</li>",
  "搜索图片": "data-original=\"&&\"",
  "搜索标题": "title=\"&&\"",
  "搜索链接": "<a href=\"&&\"",
  "搜索副标题": "text-right\">&&</span>",
  "影片年代": "年份：&&</p>",
  "影片地区": "地区：&&/",
  "影片类型": "类型：&&/",
  "导演": "导演：&&</p>",
  "主演": "主演：&&</p>",
  "简介": "display: none;\">&&</span>",
  "线路数组": "<span class=\"pull-right\">&&/h3>",
  "线路标题": "<h3>&&<",
  "播放数组": "<ul class=\"myui-content__playlist&&</ul>",
  "过滤词":"=http",
*/
    "筛选":{
"/id/6":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/6"},{"n":"国产剧","v":"/id/41"},{"n":"港剧","v":"/id/42"},{"n":"台剧","v":"/id/43"},{"n":"日剧","v":"/id/44"},{"n":"韩剧","v":"/id/45"},{"n":"欧美剧","v":"/id/46"},{"n":"泰剧","v":"/id/47"},{"n":"新马剧","v":"/id/48"},{"n":"其他剧","v":"/id/49"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}],
"/id/7":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/7"},{"n":"动画电影","v":"/id/28"},{"n":"喜剧片","v":"/id/24"},{"n":"冒险片","v":"/id/25"},{"n":"剧情片","v":"/id/26"},{"n":"动作片","v":"/id/27"},{"n":"爱情片","v":"/id/35"},{"n":"科幻片","v":"/id/37"},{"n":"悬疑片","v":"/id/32"},{"n":"惊悚片","v":"/id/50"},{"n":"恐怖片","v":"/id/31"},{"n":"犯罪片","v":"/id/36"},{"n":"奇幻片","v":"/id/30"},{"n":"灾难片","v":"/id/34"},{"n":"战争片","v":"/id/40"},{"n":"歌舞片","v":"/id/33"},{"n":"网络电影","v":"/id/39"},{"n":"同性片","v":"/id/29"},{"n":"经典片","v":"/id/38"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/大陆"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"日本","v":"/area/日本"},{"n":"韩国","v":"/area/韩国"},{"n":"欧美","v":"/area/欧美"},{"n":"泰国","v":"/area/泰国"},{"n":"新马","v":"/area/新马"},{"n":"其它","v":"/area/其它"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}],
"/id/5":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/5"},{"n":"国产动漫","v":"/id/51"},{"n":"日本动漫","v":"/id/52"},{"n":"港台动漫","v":"/id/53"},{"n":"欧美动漫","v":"/id/54"},{"n":"韩国动漫","v":"/id/55"},{"n":"新马泰动漫","v":"/id/56"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}],
"/id/3":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/3"},{"n":"大陆综艺","v":"/id/57"},{"n":"港台综艺","v":"/id/58"},{"n":"日本综艺","v":"/id/59"},{"n":"韩国综艺","v":"/id/60"},{"n":"欧美综艺","v":"/id/61"},{"n":"新马泰综艺","v":"/id/62"},{"n":"其他综艺","v":"/id/63"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2025","v":"/year/2025"},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}],
"/id/64":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/64"},{"n":"古装","v":"/id/65"},{"n":"虐恋","v":"/id/66"},{"n":"逆袭","v":"/id/67"},{"n":"悬疑","v":"/id/68"},{"n":"神豪","v":"/id/69"},{"n":"重生","v":"/id/70"},{"n":"复仇","v":"/id/71"},{"n":"穿越","v":"/id/72"},{"n":"甜宠","v":"/id/73"},{"n":"强者","v":"/id/74"},{"n":"萌宝","v":"/id/75"},{"n":"合集","v":"/id/76"},{"n":"其它","v":"/id/77"},]},{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}]
    }
}
